app/controllers/boards_controller.rb

  def index
    @boards = Board.order(created_at: :desc).limit(10)
---
SELECT "boards".* FROM "boards" ORDER BY "boards"."created_at" DESC LIMIT $1  [["LIMIT", 10]]

  def create
    email = board_params[:email]
    rows = board_params[:rows].to_i
    cols = board_params[:cols].to_i
    mines = board_params[:mines].to_i

    mines_location = locations(rows, cols, mines)

    @board = Board.new(email: email, rows: rows, cols: cols, mines: mines_location)

    if @board.save
---
INSERT INTO "boards" ("email", "mines", "rows", "cols", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["email", nil], ["mines", nil], ["rows", nil], ["cols", nil], ["created_at", "2023-07-19 16:45:40.631119"], ["updated_at", "2023-07-19 16:45:40.631119"]]

  def show
    begin
      @board = Board.find(params[:id])
---
SELECT "boards".* FROM "boards" WHERE "boards"."id" = $1 LIMIT $2  [["id", 300], ["LIMIT", 1]]